[
    {
        "id": "brazos",
        "name": "Brazos River",
        "flowMax": "5,000 cfs",
        "flowMin": "200 cfs",
        "flowOptimum": "500 - 3,000 cfs",
        "description": "The Brazos River forms at the confluence off its Double Mountain Fork, beginning in Lubbock County, and Salt Fork, beginning in Crosby County, then merging in eastern Stonewall County near the Haskell County Line. Navigable flows begin below the Clear Fork confluence in Young County just southwest of Graham. The river is a long, slow flatwater stream that flows south by southeast to the Gulf of Mexico in Brazoria County, near Houston. While the river runs for about 840 miles, this report will detail those navigable sections where people can go to paddle, particularly below Possum Kingdom Dam in Palo Pinto County, Highway 180 near Mineral Wells in Palo Pinto County to FM 1189 near Dennis in Parker County, Mitchell Ford to Brazos Point Crossing in Somervell County, Lake Whitney in Hill County to Waco in McLennan County and the Hidalgo Falls section near Navasota in Brazos and Washington Counties.",
        "categories": ["fishing", "camping", "whitewater"],
        "length": "",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/0aa90a6d7641b37b6be0828301dc9ff7/raw/f090af09d4b545462ef696648782d6079063da57/map-brazos.geojson"
    },
    {
        "id": "canadian",
        "name": "Canadian River",
        "description": "eh?",
        "categories": ["fishing", "camping"],
        "length": ""
    },
    {
        "id": "colorado",
        "name": "Colorado River",
        "flowMax": "5000 cfs",
        "flowMin": "200 cfs",
        "flowOptimum": "500 - 3,000 cfs",
        "description": "The Colorado River rises in Dawson County on the Texas-New Mexico border and flows for about 600 miles to the mouth at the Gulf of Mexico at Matagorda Bay through the rolling prairie of the high plains of West Texas, down through the Hill Country, which begins in San Saba County with its gorgeous canyons, then through the Balcones Escarpment near Austin and finally through the lower Hill Country below Austin to the and coastal lowlands that are parts of Texas topography. Along the way is a river that has a huge drainage basin including several other major rivers and many creeks, draws, sloughs and other tributaries, all feeding water into the river on its way down south. Above Austin, the river is dammed to form the series of Highland Lakes - Buchanan, Inks, LBJ, Marble Falls, Travis, Austin and Town Lake.",
        "categories": ["fishing", "camping"],
        "length": "",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/276ceb4accf0bc7cab23c4565b027306/raw/4fe6f6e78cd425bfbefd19171dcc164856f3d462/map-colorado.geojson"
    },
    {
        "id": "guadalupe",
        "name": "Guadalupe River",
        "flowMax": "5000 cfs",
        "flowMin": "150 cfs",
        "flowOptimum": "500 - 2,000 cfs",
        "description": "The Guadalupe is the gem of Texas rivers, offering everything from tame flatwater to challenging Class III rapids and water falls. It is a spring-fed river that flows over a bed of limestone from about 20 miles west of Hunt, in Kerr County, down to a rocky bed toward Canyon Lake in Comal County over a distance of about 82 miles, then another 280-300 miles to San Antonio Bay on the Gulf of Mexico. This report covers the river from its headwaters down to Loop 337 in New Braunfels, including the parts most generally used for recreational activities such as canoeing, kayaking, rafting and tubing on Texas' finest whitewater river.",
        "categories": ["fishing", "camping", "whitewater"],
        "length": "",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/4fffd9f80ece7fa27314e8e0fda6aeda/raw/2e6f8443e3e26f7a63a6ca58ca4ab03bc0da761b/map-guadalupe.geojson"
    },
    {
        "id": "lavaca",
        "name": "Lavaca River",
        "description": "",
        "categories": ["fishing", "camping"],
        "length": ""
    },
    {
        "id": "medina",
        "name": "Medina River",
        "flowMax": "1000 cfs",
        "flowMin": "125 cfs",
        "flowOptimum": "250 - 700 cfs",
        "description": "The Medina River is a short, narrow, beautiful river that is reminescent of the Upper Guadalupe because of the physical nature of its topography. Starting in northwest Bandera County, it winds about 116 miles through Bandera, Medina and Bexar Counties to its confluence with the San Antonio River just southeast of the City of San Antonio. The Medina is a narrow river averaging about 30-40 feet wide and is lined with Bald Cypress trees, though not nearly as many as before the flood of 2002. Nearby, Live Oak and rugged Cedar are abundant. The Medina cuts through limestone bluffs and outcroppings with abundant free-flowing springs to feed the river, especially after heavy rains. With few prominent hazards to fear almost anybody can enjoy this gorgeous river as long as they are prepared for a very tight, technical stream with sharp turns and debris piles. Care should be taken as to which reach of the river to paddle based upon skills and experience.",
        "categories": ["fishing", "camping"],
        "length": "",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/b8b96d94719eea52efcacabe9c229d88/raw/531fa37dab6bdaefc646f9d12f4998c95ea0c606/map-medina.geojson"
    },
    {
        "id": "neches",
        "name": "Neches River",
        "flowMax": "10,000 cfs",
        "flowMin": "500 cfs",
        "flowOptimum": "1,000 - 5,000  cfs",
        "description": "Deep East Texas is known for its flatwater rivers flowing through tall pine forests, dense riverbank vegetation, strainers created by downed trees and dead-end channels that deceive paddlers.The Neches is an historic river in Texas lore that begins in Van Zandt County and flows through Smith, Henderson, Cherokee, Anderson, Houston, Angelina, Jasper, Tyler, Hardin and Orange Counties on its 416 mile journey to the Gulf of Mexico at Port Neches. With a drainage area of 10,011 square miles the Neches River dumps about 6 million acre-feet of water into the Gulf of Mexico each year. Lake Palestine in Anderson, Henderson and Smith Counties and B.A. Steinhagen Lake in Jasper and Tyler Counties are the two major reservoirs created by damming the Neches. The river has adequate flow for paddle trips most of the time, though the flow may be slower and more shallow than normal during droughts or long periods without recent heavy local rainfall. Logjams can be an obstruction to paddling on many parts of the Neches, particularly on the upper sections where the river flows through Davy Crockett National Forest and the Big Thicket National Preserve.",
        "categories": ["fishing", "camping", "whitewater"],
        "length": "",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/29f0ce0c0b52eb8ed5cecad740dea9e3/raw/f6285214fe9037a547ea05f3f63c920fc84c7dab/map-neches.geojson"
    },
    {
        "id": "nueces",
        "name": "Nueces River",
        "flowMax": "1,500 cfs",
        "flowMin": "125 cfs",
        "flowOptimum": "250 - 700  cfs",
        "description": "The Spanards gave the Nueces River its name, which means 'nuts', because of all the pecan trees found lining its banks and adjacent land, or perhaps because you would have to be nuts to try paddling it most of the time. To say it is not a perennial stream would be an understatement, but after a good rain in its watershed the Nueces is a fantastic and very remote river to paddle in a canoe or kayak. The headwaters of the Nueces River rise from springs in northwestern Real County and northeastern Edwards County and flow some 315 miles or more through Edwards, Uvalde, Zavala, Dimmit, La Salle, McMullen, Live Oak, San Patricio and Nueces Counties into the Gulf of Mexico. Above the first FM 335 crossing and below State Highway 55 in Uvalde County the river is generally too shallow to paddle except during flood stage, when it becomes dangerous. In the Three Rivers area, where the Nueces reaches the confluence of the Atascosa and Frio Rivers, the flow will increase significantly for some recreational uses, but the river takes on the characteristics of a coastal waterway as it makes its way through the coastal plains of far South Texas. Lake Corpus Christi is about 40 miles upriver from Nueces Bay. Because of river conditions below SH 55, this report will cover the upper 98.6 miles starting at FM 18 in Edwards County very near the Real County Line and ending at US Highway 57 just east of La Pryor in Zavalla County.",
        "categories": ["fishing", "camping", "whitewater"],
        "length": "",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/70d83341ac14aad182c71e0a8fdd9542/raw/110b5877ecc15c12bd4fc76e7f615a70cee051aa/map-nueces.geojson"
    },
    {
        "id": "red",
        "name": "Red River",
        "description": "",
        "categories": ["fishing", "camping"],
        "length": ""
    },
    {
        "id": "rio-grande",
        "name": "Rio Grande River",
        "flowMax": "1,200 cfs",
        "flowMin": "200 cfs",
        "flowOptimum": "300 - 1,000  cfs",
        "description": "The Rio Grande, or Rio Bravo del Norte, as it is known in Mexico, is the most remote river in Texas, and is one of the very few true wilderness trips available in the United States (even though it is really in the Country of Texas!) Flowing through the Texas-Mexico desert, the river offers spectacular views of high mountains, the desert floor, wild animals, beautiful sunrises and sunsets, breathtaking flora and fauna and just about everything except signs of civilization. In many cases, the only people you will see are in your own group.",
        "categories": ["fishing", "camping"],
        "length": "1,885 miles",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/80689f61e28f0371dcf227593f9e684b/raw/54b6c0dd0af0c73e9a42e4f1e4b32efc789580f9/map-rio-grande.geojson"
    },
    {
        "id": "sabine",
        "name": "Sabine River",
        "flowMax": "5,000 cfs",
        "flowMin": "500 cfs",
        "flowOptimum": "1,000 - 2,000  cfs",
        "description": "The Sabine River in East Texas forms where the South Fork, starting in Collin County, and the Cowleech Fork of Hunt County, merge in southern Hunt County before beginning a trek of about 555 miles. The river flows through the piney woods of deep East Texas and forms the partial boundary between Texas and Louisiana before reaching its mouth on Sabine Lake at the Gulf of Mexico. 'Sabine' is the Spanish name for 'Cypress', and describes the character of the river as it flows between banks lined with tall, huge Bald Cypress trees and the Cypress swamps of East Texas. The Sabine is a flatwater river that pumps about 6.8 million acre-feet into the Gulf, and is the single largest volume river in Texas in terms of its discharge. The water has the tannic acid brown color that is common in East Texas rivers and streams.",
        "categories": ["fishing", "camping"],
        "length": "",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/8955783f0ec85b3c3adab940e7f1ed05/raw/d81fa113dca9f073b7134d566d3aa0b8f087101b/map-sabine.geojson"
    },
    {
        "id": "san-antonio",
        "name": "San Antonio River",
        "flowMax": "1,500 cfs",
        "flowMin": "250 cfs",
        "flowOptimum": "450 - 1,000  cfs",
        "description": "Forming at Blue Hole Spring on the campus of the University of the Incarnate Word inside the city limits of its namesake in Bexar County, the San Antonio River rises in southcentral Texas as a coastal plains flatwater stream, then gently meanders its way southeast through Wilson, Karnes, Goliad, Victoria, Refugio and calhoun Counties some 236 miles to its confluence with the Guadalupe River near San Antonio Bay on the Gulf of Mexico. The river is fed by numerous springs, as well as inflow from the Medina River, Cibolo Creek and several lesser creeks and streams that provide a near-constant navigable level. A couple of scenic waterfalls are near Falls City between Floresville and Hobson, but other than that the river is flat without rapids of any significance. The major obstacles to paddling the San antonio River are deadfall logjams and the steep, often muddy banks that contain the river. Surprisingly, even in low-water periods the San Antonio River seems to find a way to produce a generous current that helps paddlers move downriver.",
        "categories": ["fishing", "camping"],
        "length": "",
        "url": "https://gist.githubusercontent.com/PaddyMurphy/260e7512a9c3b48f5e4c65075b75c14a/raw/7fe4e158d3a9547991846d44c0021b83e4c4a6b3/map-san-antonio.geojson"
    },
    {
        "id": "san-jacinto",
        "name": "San Jacinto River",
        "description": "",
        "categories": ["fishing", "camping"],
        "length": ""
    },
    {
        "id": "sulfer",
        "name": "Sulfer River",
        "description": "",
        "categories": ["fishing", "camping"],
        "length": ""
    },
    {
        "id": "trinity",
        "name": "Trinity River",
        "description": "",
        "categories": ["fishing", "camping"],
        "length": ""
    }
]
